[
  {
    "Project_Name": "Mixue Website",
    "Description": "Developed a web-based online store application using HTML, CSS, and JavaScript, aimed at facilitating customers in accessing comprehensive information about Mixue. The application provided an intuitive interface for users to explore and gather details about Mixue's products and services.",
    "Tech_Stack": ["HTML", "CSS", "Javascript", "Vercel"],
    "Link_Github": "https://github.com/RizqGyx/Mixue-Clone",
    "Link_Deploy": "https://mixue-clone.vercel.app"
  },
  {
    "Project_Name": "React Portfolio",
    "Description": "This portfolio project is an interactive website built using cutting-edge technologies, including React.js, Tailwind CSS, and React Motion. With an elegant design touch, the project allows users to easily explore an individual's portfolio.",
    "Tech_Stack": ["React.js", "Tailwind", "Vercel"],
    "Link_Github": "https://github.com/RizqGyx/React-Porto",
    "Link_Deploy": "https://berzkireact.vercel.app"
  },
  {
    "Project_Name": "Western Corner",
    "Description": "Creating a web-based online store application aimed at assisting store customers in accessing information about a Western Store. The application will be built using React.js (React-dom) and Tailwind CSS (leveraging Daisy UI as the Framework), with data stored from a JSON file.",
    "Tech_Stack": ["React.js", "Tailwind", "Daisy UI", "Vercel"],
    "Link_Github": "https://github.com/RizqGyx/Restaurant-react",
    "Link_Deploy": "https://westcorner-restaurant.vercel.app"
  },
  {
    "Project_Name": "Detikcom Test",
    "Description": "Developed a responsive, modern, and engaging landing page as part of an internship test at Detikcom, utilizing HTML, CSS, and JavaScript exclusively. The result was a visually appealing and user-friendly landing page designed to captivate and engage visitors effectively.",
    "Tech_Stack": ["HTML", "CSS", "Javascript", "Vercel"],
    "Link_Github": "https://github.com/RizqGyx/Detikcom_FrontendDesignAssignment_MuhammadRizki",
    "Link_Deploy": ""
  },
  {
    "Project_Name": "Simple Bookshelf",
    "Description": "A web application developed using HTML, Tailwind CSS(Daisy UI as Framework), and JavaScript. It offers users the capability to maintain a book list, along with the functionality to mark books as 'read' or 'unread.' Additionally, users can dynamically add new book data to the bookshelf, enabling them to organize their reading progress.",
    "Tech_Stack": ["HTML", "Tailwind", "Daisy UI", "Javascript", "Vercel"],
    "Link_Github": "https://github.com/RizqGyx/Bookshelf",
    "Link_Deploy": "https://bookshelf-vanilla.vercel.app"
  },
  {
    "Project_Name": "Simple React Note",
    "Description": "A React-based web application utilizing Tailwind CSS (Daisy UI Framework) for styling. It incorporates a dummy data storage system from a JSON file, presenting this data as the default view upon initialization. Users have the ability to add new notes dynamically. Additionally, they can mark these notes as 'done' or 'undone'.",
    "Tech_Stack": ["React.js", "Tailwind", "Daisy UI", "Vercel"],
    "Link_Github": "https://github.com/RizqGyx/note-app-react",
    "Link_Deploy": "https://noteapp-react-six.vercel.app"
  },
  {
    "Project_Name": "Flutter To-Do",
    "Description": "This Todo project is a mobile application developed using Flutter, a cross-platform app development framework. The application is designed to assist users in managing their task lists easily. Users can add, edit, and delete tasks, as well as mark tasks as completed. With a simple and efficient user interface, this application helps users stay organized in their daily lives.",
    "Tech_Stack": ["Flutter"],
    "Link_Github": "https://github.com/RizqGyx/Flutter-Todo",
    "Link_Deploy": ""
  },
]
